In [1]:
import pandas as pd

In [ ]:
file_path = "takeo/customer.csv"

In [7]:
df = pd.read_csv('customer.csv')
df.head(5)

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [8]:
df = pd.read_csv('customer.csv')
df.tail(5)

    age  gender review education purchased
45   61    Male   Poor        PG       Yes
46   64  Female   Poor        PG        No
47   38  Female   Good        PG       Yes
48   39  Female   Good        UG       Yes
49   25  Female   Good        UG        No

In [9]:
df.describe()

             age
count  50.000000
mean   54.160000
std    25.658161
min    15.000000
25%    30.250000
50%    57.000000
75%    74.000000
max    98.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        50 non-null     int64
 1   gender     50 non-null     object
 2   review     50 non-null     object
 3   education  50 non-null     object
 4   purchased  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [11]:
df.head()

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [13]:
age_greater_than_30 = df[df['age']>30]

In [14]:
age_greater_than_30.head(5)

   age  gender   review education purchased
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
5   31  Female  Average    School       Yes
7   60  Female     Poor    School       Yes

In [15]:
df.isnull().sum()

age          0
gender       0
review       0
education    0
purchased    0
dtype: int64

In [16]:
df.sample(5)

    age  gender review education purchased
17   22  Female   Poor        UG       Yes
15   75    Male   Poor        UG        No
39   76    Male   Poor        PG        No
16   59    Male   Poor        UG       Yes
2    70  Female   Good        PG        No

In [17]:
df.nunique()

age          41
gender        2
review        3
education     3
purchased     2
dtype: int64

In [19]:
df.columns

Index(['age', 'gender', 'review', 'education', 'purchased'], dtype='object')

In [20]:
#df.filter[df['Age']>30 & ]

In [21]:
df.memory_usage()

Index        132
age          400
gender       400
review       400
education    400
purchased    400
dtype: int64

In [ ]:
There is no IT department